# open $path
# | parse-docstrings
# | to yaml
- command_name: links-link-all
  command_description: Add the same text particle into the 'from' or 'to' column of the temp cyberlinks table
  examples:
  - annotation: ''
    command: |-
      > [[from_text, to_text]; ['cyber-prophet' null] ['tweet' 'cy is cool!']]
      | sort-by from_text | to yaml
    result: |-
      - from_text: cyber-prophet
        to_text: master
        from: QmXFUupJCSfydJZ85HQHD8tU1L7CZFErbRdMTBxkAmBJaD
        to: QmZbcRTU4fdrMy2YzDKEUAXezF3pRDmFSMXbXYABVe3UhW
      - from_text: tweet
        to_text: cy is cool!
        from: QmbdH2WBamyKLPE5zu4mJ9v49qvY8BFfoumoVPMR5V4Rvx
        to: QmddL5M8JZiaUDcEHT2LgUnZZGLMTTDEYVKWN1iMLk6PY8
  - annotation: Some random example
    command: |-
      > ls
      | sort-by modified
      ; echo 'hello'
    result: hello
  - annotation: Some random example
    command: |-
      > ls
      | sort-by modified;
      > echo 'hello'
    result: hello
  - annotation: |-
      Some random example
      multiline
    command: '> ls'
    result: test
  - annotation: Some random example multiline
    command: '> ls'
    result: ''
  input: |
    # Add the same text particle into the 'from' or 'to' column of the temp cyberlinks table
    #
    # > [[from_text, to_text]; ['cyber-prophet' null] ['tweet' 'cy is cool!']]
    # | sort-by from_text | to yaml
    # - from_text: cyber-prophet
    #   to_text: master
    #   from: QmXFUupJCSfydJZ85HQHD8tU1L7CZFErbRdMTBxkAmBJaD
    #   to: QmZbcRTU4fdrMy2YzDKEUAXezF3pRDmFSMXbXYABVe3UhW
    # - from_text: tweet
    #   to_text: cy is cool!
    #   from: QmbdH2WBamyKLPE5zu4mJ9v49qvY8BFfoumoVPMR5V4Rvx
    #   to: QmddL5M8JZiaUDcEHT2LgUnZZGLMTTDEYVKWN1iMLk6PY8
    #
    # Some random example
    # > ls
    # | sort-by modified
    # ; echo 'hello'
    # hello
    #
    # Some random example
    # > ls
    # | sort-by modified;
    # > echo 'hello'
    # hello
    #
    # Some random example
    # multiline
    # > ls
    # test
    #
    # Some random example multiline
    # > ls
- command_name: links-link-all-2
  command_description: ''
  examples:
  - annotation: Some random example multiline 2
    command: '> ls'
    result: ''
  input: |
    # Some random example multiline 2
    # > ls
- command_name: test
  command_description: no example provided
  examples: []
  input: |
    # no example provided
